In [1]:
import mysql.connector as ms 
import pandas
conn = ms.connect(host='localhost',
                                       database='my_db',
                                       user='parsa',
                                       password='Shar@25a')
cursor =conn.cursor(dictionary=True)

In [2]:
cursor.execute('''CREATE TABLE EMPLOYEE(
   FIRST_NAME CHAR(20) NOT NULL,
   LAST_NAME CHAR(20),
   AGE INT,
   SEX CHAR(1),
   INCOME FLOAT)''')

In [3]:
cursor.execute("""INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) 
   VALUES ('Mac', 'Mohan', 20, 'M', 2000),('Priti', 'Soni', 23, 'F', 5000),('Neha', 'Roy', 26, 'F', 8000)""")

In [4]:
cursor.execute("SELECT * FROM EMPLOYEE")
result = cursor.fetchall()
result

[{u'AGE': 20,
  u'FIRST_NAME': u'Mac',
  u'INCOME': 2000.0,
  u'LAST_NAME': u'Mohan',
  u'SEX': u'M'},
 {u'AGE': 23,
  u'FIRST_NAME': u'Priti',
  u'INCOME': 5000.0,
  u'LAST_NAME': u'Soni',
  u'SEX': u'F'},
 {u'AGE': 26,
  u'FIRST_NAME': u'Neha',
  u'INCOME': 8000.0,
  u'LAST_NAME': u'Roy',
  u'SEX': u'F'}]

In [5]:
table_df = pandas.DataFrame.from_dict(result)
table_df

   AGE FIRST_NAME  INCOME LAST_NAME SEX
0   20        Mac  2000.0     Mohan   M
1   23      Priti  5000.0      Soni   F
2   26       Neha  8000.0       Roy   F

In [6]:
conn.commit() #to save all changes

In [7]:
#cursor.execute("DROP TABLE EMPLOYEE") #to detele the table 
conn.close() #to close the current connection